---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings.SingleLineGap
source: html/f522b726-a699-b433-8fc0-460f48003b10.htm
---
# Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings.SingleLineGap Property

The gap for the single hidden lines where segments cross.

## Syntax (C#)
```csharp
public double SingleLineGap { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The gap size must be between 0" and 3/4".